# 1 задание
'''
print(123)
print('sdlfhjwer')
age=13
print('Количество лет', age)

print('Введите числа, потом строку ')
chisl=int (input('Введите числа:'))
st= input('Введите строку:')
print('Введённые числа:', chisl)
print('Введенная строка:', st)

# 3 задание
n=int(input('Введите число N='))
z=n+(n*10+n)+(n*100+n*10+n)
print('N+NN+NNN=', z)

# 2 Задание
i=int(input('Введите число секунд :'))
h=i//3600
m=(i-h*3600)//60
s=(i-3600*h)%60
print(h,':',m,':',s)
'''
# 4 задание
# i = int(input('Введите целое положительное число:'))
print('sldfkj')
'''
if i<0
    print('Число',i,'не положительное')
if type(i)<>int
    print('Число',i,'не целое')
'''